Австралия/src/Catalogs/AutomaticDiscountTypes/AutomaticDiscountTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AutomaticDiscountTypes</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Acts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AssignmentMethod</name>
    <type>
      <types>EnumRef.DiscountValueType</types>
    </type>
  </attributes>
  <attributes>
    <name>Purpose</name>
    <type>
      <types>EnumRef.DiscountsArea</types>
    </type>
  </attributes>
  <attributes>
    <name>AssignmentArea</name>
    <type>
      <types>EnumRef.DiscountApplyingArea</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RestrictionByProductsVariant</name>
    <type>
      <types>EnumRef.DiscountApplyingFilterType</types>
    </type>
  </attributes>
  <attributes>
    <name>IsRestrictionOnRecipientsCounterparties</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsRestrictionOnRecipientsCounterpartySegments</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsRestrictionByRecipientsWarehouses</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ThereIsSchedule</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalOrderingAttribute</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsClarificationByProducts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsClarificationByProductsCategories</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsClarificationByPriceGroups</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsClarificationByProductsSegments</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AssignmentCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>SharedUsageVariant</name>
    <type>
      <types>EnumRef.DiscountsApplyingRules</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ThereAreFoldersToBeClarifiedByProducts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>TimeByDaysOfWeek</name>
    <attributes>
      <name>Selected</name>
      <comment>(Common) Shows a selected day of the week</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>WeekDay</name>
      <comment>(Common) Day of the week</comment>
      <type>
        <types>EnumRef.WeekDays</types>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <comment>(Common) Discount validity start time</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <comment>(Common) Discount expiration time</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ProductsGroupsPriceGroups</name>
    <attributes>
      <name>ValueClarification</name>
      <type>
        <types>CatalogRef.ProductSegments</types>
        <types>CatalogRef.Products</types>
        <types>CatalogRef.ProductsCategories</types>
        <types>CatalogRef.PriceGroups</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ConditionsOfAssignment</name>
    <attributes>
      <name>AssignmentCondition</name>
      <type>
        <types>CatalogRef.DiscountConditions</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DiscountRecipientsCounterparties</name>
    <attributes>
      <name>Recipient</name>
      <type>
        <types>CatalogRef.Counterparties</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DiscountRecipientsWarehouses</name>
    <attributes>
      <name>Recipient</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DiscountRecipientsCounterpartySegments</name>
    <attributes>
      <name>Recipient</name>
      <type>
        <types>CatalogRef.CounterpartySegments</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Enums/DiscountsApplyingRules/DiscountsApplyingRules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DiscountsApplyingRules</name>
  <enumValues>
    <name>Exclusion</name>
  </enumValues>
  <enumValues>
    <name>Minimum</name>
  </enumValues>
  <enumValues>
    <name>Max</name>
  </enumValues>
  <enumValues>
    <name>Addition</name>
  </enumValues>
  <enumValues>
    <name>Multiplication</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/AutomaticDiscountTypes/Forms/GroupForm/Module.bsl
#Region FormEventsHandlers

// Procedure - OnCreateAtServer event handler.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	AllowedEditDocumentPrices = DriveAccessManagementReUse.AllowedEditDocumentPrices();
	ReadOnly = Not AllowedEditDocumentPrices;
	
	If Parameters.Key = Undefined Or Parameters.Key.IsEmpty() Then
		
		If Object.SharedUsageVariant.IsEmpty() Then
			Object.SharedUsageVariant = Enums.DiscountsApplyingRules.Max;
		EndIf;
		Object.Description = String(Object.SharedUsageVariant);
		
	EndIf;
	
	NativeLanguagesSupportServer.OnCreateAtServer(ThisObject, Object);
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)

	NativeLanguagesSupportServer.BeforeWriteAtServer(CurrentObject);
	
EndProcedure

#EndRegion

#Region FormItemEventsHandlers

// Procedure - event handler OnChange item DiscountsSharedUsageOption.
//
&AtClient
Procedure SharedUsageVariantOfDiscountChargeOnChange(Item)
	
	If IsBlankString(Object.Description) Then
		Object.Description = String(Object.SharedUsageVariant);
	Else
		For Each ItemOfList In Items.SharedUsageVariantOfDiscountCharge.ChoiceList Do
			If String(ItemOfList.Value) = Object.Description Then
				Object.Description = String(Object.SharedUsageVariant);
				Break;
			EndIf;
		EndDo;
	EndIf;
	
EndProcedure

&AtClient
Procedure Attachable_Open(Item, StandardProcessing)
	NativeLanguagesSupportClient.OnOpen(ThisObject, Object, Item, StandardProcessing);
EndProcedure

#EndRegion
